Revit 2027 API
PlasticvinylBumpType Enumeration
 The enumerated type representing the permitted values for the asset property "PlasticvinylBump" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum PlasticvinylBumpType
Public Enumeration PlasticvinylBumpType
public enum class PlasticvinylBumpType
type PlasticvinylBumpType
Members
Member name | Value | Description
Custom | 1
None | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace